app/views/owners/index.html.erb

SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" IN (1, 2, 3)
SELECT COUNT(*) FROM "pets" WHERE "pets"."owner_id" = 1
---
        <td><%= owner.phone %></td>
        <td><%= owner.pets.count %></td>