app/views/owners/show.html.erb

SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" = 5
---
  <tbody>
    <% @owner.pets.each do |pet| %>