app/views/pets/_form.html.erb

SELECT "owners".* FROM "owners" ORDER BY "owners"."last_name" ASC
---
  <%= form.label :owner_id, "Owner", class: "form-label" %>
  <%= form.collection_select :owner_id, Owner.order(:last_name), :id, :last_name, { include_blank: "Select owner" }, class: "form-select" %>