app/views/pets/index.html.erb

SELECT "owners".* FROM "owners" WHERE "owners"."id" IN (2, 1, 3)
---
        <td><%= pet.breed %></td>
        <td><%= link_to "#{pet.owner.first_name} #{pet.owner.last_name}", pet.owner %></td>