app/views/pets/show.html.erb

<p><strong>Weight:</strong> <%= @pet.weight %></p>
<p><strong>Owner:</strong> <%= link_to "#{@pet.owner.first_name} #{@pet.owner.last_name}", @pet.owner %></p>
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = 1 LIMIT 1

  <tbody>
    <% @pet.appointments.upcoming.each do |appointment| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = 1

        <td><%= appointment.date.strftime("%B %d, %Y") %></td>
        <td><%= link_to "#{appointment.vet.first_name} #{appointment.vet.last_name}", appointment.vet %></td>
---
SELECT "vets".* FROM "vets" WHERE "vets"."id" = 2 LIMIT 1

        <td><%= appointment.date.strftime("%B %d, %Y") %></td>
        <td><%= link_to "#{appointment.vet.first_name} #{appointment.vet.last_name}", appointment.vet %></td>
---
SELECT "vets".* FROM "vets" WHERE "vets"."id" = 1 LIMIT 1

<div class="mb-3">
  <% if @pet.appointments.any? %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = 1


<% treatments = @pet.appointments.includes(:treatments).flat_map(&:treatments) %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."pet_id" = 1
SELECT "treatments".* FROM "treatments" WHERE "treatments"."appointment_id" IN (2, 7)