app/views/vets/show.html.erb

  <tbody>
    <% @vet.appointments.upcoming.each do |appointment| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."vet_id" = 1

<ul>
  <% Vet.by_specialization(@vet.specialization).where.not(id: @vet.id).each do |v| %>
---
SELECT "vets".* FROM "vets" WHERE "vets"."specialization" = 'see animals' AND "vets"."id" != 3