app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.includes(:pet, :vet)
---
SELECT "appointments".* FROM "appointments"
SELECT "pets".* FROM "pets" WHERE "pets"."id" IN (33, 34, 31, 32, 35)
SELECT "vets".* FROM "vets" WHERE "vets"."id" IN (14, 13)

  def show
    @appointment = Appointment.includes(treatments: :rich_text_clinical_notes).find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 1 LIMIT 1

  def create
    @appointment = Appointment.new(appointment_params)
    if @appointment.save
---
INSERT INTO "appointments" ("created_at", "date", "pet_id", "reason", "status", "updated_at", "vet_id") VALUES ('2026-04-30 13:48:22.954645', '2026-04-09 13:50:00', 6, 'leazy', 0, '2026-04-30 13:48:22.954645', 3) RETURNING "id"

  def destroy
    @appointment.destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 980190962]]