app/controllers/owners_controller.rb

  def index
    @owners = Owner.includes(:pets)
---
SELECT "owners".* FROM "owners"
SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" IN (19, 20, 21)

  def create
    @owner = Owner.new(owner_params)
    if @owner.save
---
INSERT INTO "owners" ("address", "created_at", "email", "first_name", "last_name", "phone", "updated_at") VALUES ('', '2026-04-30 13:46:11.776311', 'hugito@gmail.com', 'mario ', 'hugo', '293489234', '2026-04-30 13:46:11.776311') RETURNING "id"

  def set_owner
    @owner = Owner.find(params[:id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = 4 LIMIT 1