app/controllers/owners_controller.rb

  def show
    @owner = Owner.find(params[:id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = 1 LIMIT 1