app/controllers/pets_controller.rb

SELECT DISTINCT "pets"."species" FROM "pets"
SELECT "owners".* FROM "owners" WHERE "owners"."id" IN (13, 14, 15)
SELECT "pets".* FROM "pets" WHERE "pets"."species" = 'rabbit'
---
  def index
    @species_list = Pet.distinct.pluck(:species)
    @species = params[:species]
    @pets = @species.present? ? Pet.by_species(@species).includes(:owner) : Pet.includes(:owner)

SELECT "pets".* FROM "pets" WHERE "pets"."id" = 1 LIMIT 1
SELECT "treatments".* FROM "treatments" WHERE "treatments"."appointment_id" IN (1, 6, 8)
SELECT "vets".* FROM "vets" WHERE "vets"."id" = 1
---
  def show
    @pet = Pet.includes(appointments: [:vet, :treatments]).find(params[:id])

INSERT INTO "pets" ("breed", "created_at", "date_of_birth", "name", "owner_id", "species", "updated_at", "weight") VALUES ('i dont know', '2026-04-30 13:47:12.928550', '2023-06-09', 'Pun pun purin', 4, 'other', '2026-04-30 13:47:12.928550', 69.0) RETURNING "id"
---
  def create
    @pet = Pet.new(pet_params)
    if @pet.save

UPDATE "pets" SET "updated_at" = '2026-05-07 13:49:43.263471' WHERE "pets"."id" = 3
---
  def update
    if @pet.update(pet_params)

SELECT "pets".* FROM "pets" WHERE "pets"."id" = 1 LIMIT 1
---
  def set_pet
    @pet = Pet.find(params[:id])