app/controllers/treatments_controller.rb

  def create
    @treatment = @appointment.treatments.build(treatment_params)
    if @treatment.save
---
INSERT INTO "treatments" ("administered_at", "appointment_id", "created_at", "dosage", "medication", "name", "notes", "updated_at") VALUES ('2026-04-10 09:52:00', 9, '2026-04-30 13:49:12.980953', 'as', 'depresivos', 'mhm', 'mucho tiepo', '2026-04-30 13:49:12.980953') RETURNING "id"

  def update
    if @treatment.update(treatment_params)
---
UPDATE "treatments" SET "dosage" = '50mg', "medication" = 'Cumisol', "name" = 'Medicado', "notes" = 'deprecion', "updated_at" = '2026-04-30 13:55:30.217906' WHERE "treatments"."id" = 6

  def destroy
    @treatment.destroy
---
DELETE FROM "treatments" WHERE "treatments"."id" = 4

  def set_appointment
    @appointment = Appointment.find(params[:appointment_id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 9 LIMIT 1

  def set_treatment
    @treatment = @appointment.treatments.find(params[:id])
---
SELECT "treatments".* FROM "treatments" WHERE "treatments"."appointment_id" = 1 AND "treatments"."id" = 4 LIMIT 1