app/controllers/vets_controller.rb

  def index
    @specializations = Vet.distinct.pluck(:specialization)
    @specialization = params[:specialization]
    @vets = @specialization.present? ? Vet.by_specialization(@specialization).includes(:appointments) : Vet.includes(:appointments)
---
SELECT DISTINCT "vets"."specialization" FROM "vets"
SELECT "appointments".* FROM "appointments" WHERE "appointments"."vet_id" IN (13, 14)
SELECT "vets".* FROM "vets" WHERE "vets"."specialization" = 'Surgery'

  def create
    @vet = Vet.new(vet_params)
    if @vet.save
---
INSERT INTO "vets" ("created_at", "email", "first_name", "last_name", "phone", "specialization", "updated_at") VALUES ('2026-04-30 13:47:47.632846', 'toto@dsf.cl', 'samuel', 'toroto', '234', 'see animals', '2026-04-30 13:47:47.632846') RETURNING "id"

  def set_vet
    @vet = Vet.find(params[:id])
---
SELECT "vets".* FROM "vets" WHERE "vets"."id" = 3 LIMIT 1