app/controllers/vets_controller.rb

SELECT "vets".* FROM "vets" WHERE "vets"."id" = 1 LIMIT 1
---
  def show
    @vet = Vet.find(params[:id])