app/views/appointments/_form.html.erb

  <%= form.label :pet_id, "Pet", class: "form-label" %>
  <%= form.collection_select :pet_id, Pet.order(:name), :id, :name, { include_blank: "Select pet" }, class: "form-select" %>
---
SELECT "pets".* FROM "pets" ORDER BY "pets"."name" ASC

  <%= form.label :vet_id, "Vet", class: "form-label" %>
  <%= form.collection_select :vet_id, Vet.order(:last_name), :id, :last_name, { include_blank: "Select vet" }, class: "form-select" %>
---
SELECT "vets".* FROM "vets" ORDER BY "vets"."last_name" ASC