app/views/appointments/index.html.erb

SELECT "vets".* FROM "vets" WHERE "vets"."id" = 1 LIMIT 1
---
        <td><%= link_to appointment.pet.name, appointment.pet %></td>
        <td><%= link_to "#{appointment.vet.first_name} #{appointment.vet.last_name}", appointment.vet %></td>